Revit 2018 API
BuiltInFailures.FamilyFailures.UnableToUpgradeDueToCorruptFamilies Property
 Unable to upgrade file due to corrupted content families. To repair the file, open the file with the Audit option enabled in [version] and reload the following families from RFA or delete the families from the document: [names].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Syntax
C#
public static FailureDefinitionId UnableToUpgradeDueToCorruptFamilies { get; }
Visual Basic
Public Shared ReadOnly Property UnableToUpgradeDueToCorruptFamilies As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ UnableToUpgradeDueToCorruptFamilies {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace